Repository: mozilla-l10n/mt-training-data
Catalog: ha/ha_pontoon.tmx
Source language: en_us
Languages: ha

source: Thanks for taking the time to review these changes. Clicking Accept will make this version of the article live! Please take a moment to be sure all options are correct.
ha: Mun gode sabo da ɗaukar lokaci ka sake nazarin waɗan nan canje-canje. Danna Na karɓa zai mayar da wannan yayi mai ban sha'awa! Ɗauki wani lokaci ka tabbatar cewa duk zaɓin dai dai su ke.

source: Thanks for taking the time to review these changes. Please thank the editor and then give specific, constructive feedback about what you feel needs to change in order for the revision to be acceptable.
ha: Mun gode sabo da ɗaukar lokaci ka sake nazarin waɗan nan canje-canje. Godewa mai gyara sannan ka bayar da amsa ta musamman kuma mai ma'ana dangane da abin da ka ke ji ya na bukatar canji domin yadda nazarin zai zama karɓaɓɓe.

source: Thanks for your help! Just so you know, Firefox OS is not available in your locale yet, and it's possible this article will change before it is.
ha: Mun gode sabo da taimaka mana1. Sabo da haka ka sani, babu Firefox OS a wurinku tukuna, kuma zai yiwu ya zama wannan maƙala ta canja kafin sannan.

source: Thanks so much for your interest in helping users of Mozilla technologies!
ha: Godiya ƙwarai da gaske domin nuna sha'awarka na taimakawa masu amfani na fusahar Mozilla!

source: Thanks, The Mozilla Support team
ha: Godiya, Ƙungiyar Tallafi ta Mozilla

source: Thank you for being awesome!
ha: Mun gode maka sabo da zama mai burgewa!

source: Thank you for choosing a solution!
ha: Godiya gareka domin zaɓar mafita!

source: Thank you for registering!
ha: Mun gode sabo da yin rijista!

source: Thank you for your contribution to Mozilla Support!
ha: Muna gode da gudun mawarka zuwa ga Tallafin Mozilla!

source: Thank you for your first contribution to the Mozilla support forums! You just made somebody's day!
ha: Mun gode domin gudun mawarka ta farko ga dandalin tallafin Mozilla! Yanzu ka sanya wani farin ciki!

source: Thank you once more. We are looking forward to seeing you more often around SUMO! Keep rocking!
ha: Muna daɗa godiya. Muna sauraro domin ganinka a-kai-a-kai a wajen SUMO! Ci gaba da jimiri!

source: Thank you! Your question will appear on the site as soon as you confirm your email address. You should receive an email shortly with a link to confirm.
ha: Mun gode! Tambayarka za ta fito a yanar gizo da zaran ka tabbatar da adireshinka na imel. Za ka sami saƙon imel nan gaba kaɗan tare da haɗin da za ka tabbatar.

source: That e-mail address doesn't have an associated user account. Are you sure you've registered?
ha: Wancan adireshin na imel ba shi da dangantaka da wani asusu na mai amfani. Ka tabbata ka na da rijista?

source: That tag does not exist.
ha: Wannan shaidar babu ita.

source: The basics of using bookmarks
ha: Tushe na amfani da zaunanniyar alama

source: The body content is too short (%(show_value)s characters). It must be at least %(limit_value)s characters.
ha: Abin cikin jiki ya yi gajarta sosai (%(show_value)s characters). Dole ya zama a ƙalla haruffa %(limit_value)s.

source: The community forum is at %(url)s .
ha: Dandalin ƙungiyar ya na %(url)s .

source: The content is too short (%(show_value)s characters). It must be at least %(limit_value)s characters.
ha: Abin ciki ya yi gajarta (%(show_value)s characters). Dole ya zama a ƙalla haruffa %(limit_value)s.

source: The dashboard data is being loaded. This may take some time.
ha: Ana loda allon bayani. Wannan na iya ɗaukar wani lokaci.

source: The {default_locale} version has no approved content to show.
ha: Shiryayyun yayi {default_locale} ba shi da abin ciki wanda aka amince da shi da za'a nuna.

source: The document %(document_title)s has a new revision that is ready for localization.
ha: Bayanin %(document_title)s yana da sabon nazari wanda ya shirya domin fassarawa.

source: The document has been deleted.
ha: An goge wannan daftarin.

source: The document "%s" does not exist.
ha: Babu daftarin "%s".

source: The {domain} team
ha: Ƙungiyar {domain}

source: The email you entered ({new_email}) already exists in the system. The current email for your account is still {old_email}.
ha: Imel da ka shigar ({new_email}) akwai shi tuni a na'ura. Imel ɗin yanzu na asusunka har yanzu shi ne {old_email}.

source: The flag is invalid.
ha: Sa alamar tuta bai dace ba.

source: The flag is valid and I fixed the issue.
ha: Sa alamar tuta ya dace kuma na gyara matsalar.

source: The following articles include this image:
ha: Waɗannan maƙaloli sun haɗa da wannan hoto:

source: The image "%s" does not exist.
ha: Hoton "%s" babu shi.

source: The message was deleted!
ha: An goge waɗan nan saƙwannin!

source: The Mozilla Support team
ha: Ƙungiyar Tallafin Mozilla

source: The password reset link was invalid, possibly because it has already been used. Please request a new password reset.
ha: Haɗin sake saita kalmar wucewa ba shi da inganci, mai yiwuwa sabo da tuni an yi amfani da shi. Sake neman saita sabuwar kalmar wucewa.

source: The question:
ha: Tambayar:

source: The questions forum isn't available for {product} in {old_lang}, we have redirected you to the {new_lang} questions forum.
ha: Babu dandalin tambayoyi na {product} a tsohon {old_lang}, mun canjaka zuwa dandalin tambayoyi na {new_lang}.

source: The questions forum isn't available in {old_lang}, we have redirected you to the {new_lang} questions forum.
ha: Babu dandalin tambayoyi a {old_lang}, mun canjaka zuwa sabon dandalin tambayoyi na {new_lang}.

source: The question: '{title}' was marked as solved by its asker, {asker}.
ha: Tambatar: '{title}' an yi mata alama a matsayin an amsa daga wanda ya yi tambayar, {asker}.

source: There are no articles.
ha: Babu maƙaloli.

source: There are no messages here.
ha: Babu saƙwanni a nan.

source: There are no threads. Maybe you should create some!
ha: Babu tattaunawa. Mai yiwuwa za ka iya ƙirƙirar wasu!

source: There are several ways in which you can get involved:
ha: Akwai hanyoyi da dama da za ka iya shiga:

source: There are {total} users with at least one contribution in the last 90 days.
ha: Akwai masu amfani {total} da suke da a ƙalla gudun mawa ɗaya a kwanaki 90 da suka gabata.

source: The refund request must be made within 10 business days of purchase.
ha: Dole a nemi mayar da kuɗi cikin kwanaki 10 na ranakun aiki daga lokaci saya.

source: There is no flagged content pending moderation.
ha: Babu abin ciki da aka saka masa alama kafin a daidaita.

source: There is no topic data available for the current selections.
ha: Babu bayanin batu da aka samu dangane da zaɓin yanzu.

source: The requested image could not be found.
ha: Ba'a sami hoton da aka tambaya ba.

source: There was an error.
ha: Akwai kuskure.

source: There was an error checking for canned responses.
ha: Akwai kuskure wajen nemo shiryayyun amsoshi.

source: There was an error generating the preview.
ha: Akwai kuskure wajen nuna misali.

source: There was an error. Please try again in a moment.
ha: Akwai kuskure. Sake jarrabawa nan da wani lokaci.

source: There was an error submitting the ticket. Please try again later.
ha: Akwai kuskure wajen miƙa tikitinka. Sake jarrabawa nan gaba.

source: There was an error submitting your vote.
ha: Akwai kuskure wajen miƙa ƙuri'arka.

source: There was a problem confirming your subscription.
ha: Akwai matsala wajen tabbatar da sautunka.

source: There was a problem unsubscribing.
ha: Akwai matsala wajen cirewa daga sautu.

source: There were errors adding leaders to the group, see below.
ha: Akwai kura-kurai wajen saka jagorori cikin ƙungiya, duba ƙasa.

source: There were errors adding members to the group, see below.
ha: Akwai kuskure wajen daɗa mambobi a ƙungiyar, dubi ƙasa.

source: There were errors adding new contributors, see below.
ha: Akwai kura-kurai wajen daɗa masu bayar da gudun mawa, duba ƙasa.

source: There were errors adding users, see below.
ha: Akwai kuskure wajen daɗa masu amfani, duba ƙasa.

source: These are the top 50 most visited articles in the last 30 days.
ha: Waɗan nan su ne maƙaloli 50 da aka fi ziyarta a kwanaki 30 da suka gabata.

source: These fine people helped write this article: %(contributors)s. You can help too - <a href="%(link)s">find out how</a>.
ha: Waɗan nan ƙyawawan jama'a sun taimaka wajen rubuta wannan maƙala: %(contributors)s. Kaima za ka iya taimakawa - <a href="%(link)s">nemi ta yaya</a>.

source: These minor changes are not important for localizers and they will not be notified.
ha: Waɗan nan ƙananan canje-canjen ba su da mahimmanci domin masu fassara kuma ba za'a sanar da su ba.

source: The {sitename} team
ha: Ƙungiyar {sitename}

source: The slug is too short (%(show_value)s characters). It must be at least %(limit_value)s characters.
ha: Tsarin ya yi gajarta sosai (%(show_value)s characters). Dole a ƙalla ya zama haruffa %(limit_value)s.

source: The slug provided is not valid.
ha: Tsarin da aka bayar ba shi da inganci.

source: The solution was undone successfully.
ha: An sami nasara na rashin kammala mafita.

source: The subject is too short (%(show_value)s characters). It must be at least %(limit_value)s characters.
ha: Batun ya yi gajarta (%(show_value)s characters). Dole ya zama a ƙalla haruffa %(limit_value)s.

source: The summary is too short (%(show_value)s characters). It must be at least %(limit_value)s characters.
ha: Taƙaitaccen bayanin ya yi gajarta sosai (%(show_value)s character). Dole a ƙalla ya zama haruffa %(limit_value)s.

source: The SUMO Army of Awesome 2010 mini-badge is part of the SUMO series. It represents contribution to SUMO in 2010; in this case: 50 Army of Awesome tweets. Congrats to all SUMO Army of Awesome 2010 badge earners for advancing the Mozilla Mission!
ha: Ƙaramin bajon Rundunar Burgewa na SUMO 2010 na daga ɓangaren jerin SUMO. Yana wakiltar gudun mawa ga SUMO a 2010; a wannan halin: tweets na Rundunar Burgewa 50. Taya murna ga duk waɗanda suka sami bajon Rundunar Burgewa na SUMO 2010 domin haɓaka Manufar Mozilla!

source: The SUMO Army of Awesome 2011 mini-badge is part of the SUMO series. It represents contribution to SUMO in 2011; in this case: 50 Army of Awesome tweets. Congrats to all SUMO Army of Awesome 2011 badge earners for advancing the Mozilla Mission!
ha: Ƙaramin bajon Rundunar Burgewa na SUMO 2011 na daga ɓangaren jerin SUMO. Yana wakiltar gudun mawa ga SUMO a 2011; a wannan halin: tweets na Rundunar Burgewa 50. Taya murna ga duk waɗanda suka sami bajon Rundunar Burgewa na SUMO 2011 domin haɓaka Manufar Mozilla!

source: The SUMO Army of Awesome 2012 mini-badge is part of the SUMO series. It represents contribution to SUMO in 2012; in this case: 50 Army of Awesome tweets. Congrats to all SUMO Army of Awesome 2012 badge earners for advancing the Mozilla Mission!
ha: Ƙaramin bajon SUMO na Rundunar Burgewa 2012 wani ɓangare ne na jerin SUMO. Yana wakiltar gudun mawa zuwa ga SUMO a 2012; a wannan yanayi: tweets 50 na Rundunar Burgewa. Taya murna ga duk waɗanda suka sami wannan bajon SUMO na Rundunar Burgewa 2012 domin haɓaka Manufar Mozilla!

source: The SUMO Army of Awesome 2013 mini-badge is part of the SUMO series. It represents contribution to SUMO in 2013; in this case: 50 Army of Awesome tweets. Congrats to all SUMO Army of Awesome 2013 badge earners for advancing the Mozilla Mission!
ha: Ƙaramin bajon SUMO na Rundunar Burgewa 2013 wani ɓangare ne na jerin SUMO. Yana wakiltar gudun mawa zuwa ga SUMO a 2013; a wannan yanayi: tweets 50 na Rundunar Burgewa. Taya murna ga duk waɗanda suka sami wannan bajon SUMO na Rundunar Burgewa 2013 domin haɓaka Manufar Mozilla!

source: The SUMO Army of Awesome 2014 mini-badge is part of the SUMO series. It represents contribution to SUMO in 2014; in this case: 50 Army of Awesome tweets. Congrats to all SUMO Army of Awesome 2014 badge earners for advancing the Mozilla Mission!
ha: Ƙaramin bajo na Rundunar Burgewa na SUMO a 2014 wani ɓangare ne na jerin SUMO. Ya na wakiltar gudun mawa zuwa SUMO a 2014; a wannan halin: tweets 50 na Rundunar Burgewa. Taya murna ga duk waɗanda suka sami wannan bajo na Rundunar Burgewa ta SUMO 2014 domin haɓaka Manufar Mozilla!

source: The SUMO Forum 2010 mini-badge is part of the SUMO series. It represents contribution to SUMO in 2010 in this case: 30 replies in the English SUMO Forum. Congrats to all SUMO Forum 2010 badge earners for advancing the Mozilla Mission!
ha: Ƙaramin bajo Dandalin SUMO 2010 wani ɓangare ne na jerin SUMO. Ya na wakiltar gudun mawa zuwa SUMO a 2010 a wannan halin: amsoshi 30 cikin Turanci ga Dandalin SUMO. Taya murna ga duk waɗanda suka sami wannan bajo Dandalin SUMO 2010 domin haɓaka Manufar Mozilla!

source: The SUMO Forum 2011 mini-badge is part of the SUMO series. It represents contribution to SUMO in 2011 in this case: 30 replies in the English SUMO Forum. Congrats to all SUMO Forum 2011 badge earners for advancing the Mozilla Mission!
ha: Ƙaramin bajo na Dandalin Tallafi 2011 na SUMO wani ɓangare ne na jerin SUMO. Ya na wakiltar gudun mawa zuwa SUMO a 2011 a wannan halin: amsoshi a Dandalin Turanci na SUMO. Taya murna ga duk waɗanda suka sami wannan bajo na Dandalin SUMO 2011 domin haɓaka Manufar Mozilla!

source: The SUMO Forum 2012 mini-badge is part of the SUMO series. It represents contribution to SUMO in 2012 in this case: 30 replies in the English SUMO Forum. Congrats to all SUMO Forum 2012 badge earners for advancing the Mozilla Mission!
ha: Ƙaramin bajon Dandali na SUMO 2012 na daga ɓangaren jerin SUMO. Yana wakiltar gudun mawa ga SUMO a 2012; a wannan halin: 30 sun bayar da amsa da Turanci a Dandalin SUMO. Taya murna ga duk waɗanda suka sami bajon Dandalin SUMO 2012 domin haɓaka Manufar Mozilla!

source: The SUMO Forum 2013 mini-badge is part of the SUMO series. It represents contribution to SUMO in 2013 in this case: 30 replies in the English SUMO Forum. Congrats to all SUMO Forum 2013 badge earners for advancing the Mozilla Mission
ha: Ƙaramin bajon SUMO na Dandalin Tallafi 2013 na daga ɓangaren jerin SUMO. Yana wakiltar gudun mawa ga SUMO a 2013; a wannan halin: 30 sun bayar da amsa da Turanci ga Dandalin SUMO. Taya murna ga duk waɗanda suka sami bajon Dandalin Tallafi na SUMO 2013 domin haɓaka Manufar Mozilla

source: The SUMO Forum 2014 mini-badge is part of the SUMO series. It represents contribution to SUMO in 2014 in this case: 30 replies in the English SUMO Forum. Congrats to all SUMO Forum 2014 badge earners for advancing the Mozilla Mission!
ha: Ƙaramin bajon Dandali na SUMO 2014 na daga ɓangaren jerin SUMO. Yana wakiltar gudun mawa ga SUMO a 2014; a wannan halin: 30 sun bayar da amsa da Turanci ga Dandalin SUMO. Taya murna ga duk waɗanda suka sami bajon Dandali na SUMO 2014 domin haɓaka Manufar Mozilla!

source: The SUMO KB 2010 mini-badge is part of the SUMO series. It represents contribution to SUMO in 2010; in this case: 10 approved edits of the English SUMO Knowledge Base. Congrats to all SUMO KB 2010 badge earners for advancing the Mozilla Mission
ha: Ƙaramin bajon SUMO KB 2010 na daga ɓangaren jerin SUMO. Yana wakiltar gudun mawa ga SUMO a 2010; a wannan halin: 10 sun amince da gyara da Turanci na Tushen Ilimi na SUMO. Taya murna ga duk waɗanda suka sami bajon KB 2010 na SUMO domin haɓaka Manufar Mozilla

source: The SUMO KB 2011 mini-badge is part of the SUMO series. It represents contribution to SUMO in 2011; in this case: 10 approved edits of the English SUMO Knowledge Base. Congrats to all SUMO KB 2011 badge earners for advancing the Mozilla Mission!
ha: Ƙaramin bajo na KB 2011 na SUMO wani ɓangare ne na jerin SUMO. Ya na wakiltar gudun mawa zuwa SUMO a 2011; a wannan halin: Gyararrakin Turanci 10 da aka amince da su zuwa Tushen Ilimi na SUMO. Taya murna ga duk waɗanda suka sami wannan bajo KB 2011 ta SUMO domin haɓaka Manufar Mozilla!

source: The SUMO KB 2012 mini-badge is part of the SUMO series. It represents contribution to SUMO in 2012; in this case: 10 approved edits of the English SUMO Knowledge Base. Congrats to all SUMO KB 2012 badge earners for advancing the Mozilla Mission!
ha: Ƙaramin bajon SUMO KB 2012 na daga ɓangaren jerin SUMO. Yana wakiltar gudun mawa ga SUMO a 2012; a wannan halin: 10 sun amince da gyara da Turanci na Tushen Ilimi na SUMO. Taya murna ga duk waɗanda suka sami bajon KB 2012 na SUMO domin haɓaka Manufar Mozilla!

source: The SUMO KB 2013 mini-badge is part of the SUMO series. It represents contribution to SUMO in 2013 in this case: 10 approved edits of the English SUMO Knowledge Base. Congrats to all SUMO KB 2013 badge earners for advancing the Mozilla Mission!
ha: Ƙaramin bajon SUMO KB 2013 na daga ɓangaren jerin SUMO. Yana wakiltar gudun mawa ga SUMO a 2013; a wannan halin: 10 sun amince da gyara da Turanci na Tushen Ilimi na SUMO. Taya murna ga duk waɗanda suka sami bajon KB 2013 na SUMO domin haɓaka Manufar Mozilla!

source: The SUMO KB 2014 mini-badge is part of the SUMO series. It represents contribution to SUMO in 2014; in this case: 10 approved edits of the English SUMO Knowledge Base. Congrats to all SUMO KB 2014 badge earners for advancing the Mozilla Mission
ha: Bajon SUMO KB 2014 na daga ɓangaren jerin SUMO. Yana wakiltar gudun mawa ga SUMO a 2014; a wannan halin: 10 sun amince da gyaran fassara na Tushen Ilimi a SUMO. Taya murna ga duk waɗanda suka sami bajon SUMO KB 2014 domin haɓaka Manufar Mozilla

source: The SUMO L10n 2010 mini-badge is part of the SUMO series. It represents contribution to SUMO in 2010; in this case: 10 approved translation edits of the SUMO Knowledge Base. Congrats to all SUMO L10n 2010 badge earners for advancing the Mozilla Mission!
ha: Ƙaramin bajon SUMO L10 2010 na daga ɓangaren jerin SUMO. Yana wakiltar gudun mawa ga SUMO a 2010; a wannan halin: 10 sun amince da fassara na Tushen Ilimi na SUMO. Taya murna ga duk waɗanda suka sami bajon L10n 2010 na SUMO domin haɓaka Manufar Mozilla!

source: The SUMO L10n 2011 mini-badge is part of the SUMO series. It represents contribution to SUMO in 2011; in this case: 10 approved translation edits of the SUMO Knowledge Base. Congrats to all SUMO L10n 2011 badge earners for advancing the Mozilla Mission!
ha: Ƙaramin bajo na L10n 2011 na SUMO wani ɓangare ne na jerin SUMO. Ya na wakiltar gudun mawa zuwa SUMO a 2011; a wannan halin: gyararraki 10 na Tushen Ilimi na SUMO. Taya murna ga duk waɗanda suka sami wannan bajo na L10 2011 na SUMO domin haɓaka Manufar Mozilla!

source: The SUMO L10n 2012 mini-badge is part of the SUMO series. It represents contribution to SUMO in 2012; in this case: 10 approved translation edits of the SUMO Knowledge Base. Congrats to all SUMO L10n 2012 badge earners for advancing the Mozilla Mission!
ha: Ƙaramin bajon SUMO L10n 2012 na daga ɓangaren jerin SUMO. Yana wakiltar gudun mawa ga SUMO a 2012; a wannan halin: 10 sun amince da gyara da na Tushen Ilimi na SUMO. Taya murna ga duk waɗanda suka sami bajon L10n 2012 na SUMO domin haɓaka Manufar Mozilla!

source: The SUMO L10n 2013 mini-badge is part of the SUMO series. It represents contribution to SUMO in 2013 in this case: 10 approved translation edits of the SUMO Knowledge Base. Congrats to all SUMO L10n 2013 badge earners for advancing the Mozilla Mission!
ha: Ƙaramin bajon SUMO L10n 2013 na daga ɓangaren jerin SUMO. Yana wakiltar gudun mawa ga SUMO a 2013; a wannan halin: 10 sun amince da gyara da Turanci na Tushen Ilimi na SUMO. Taya murna ga duk waɗanda suka sami bajon L10n 2013 na SUMO domin haɓaka Manufar Mozilla!

source: The SUMO L10n 2014 mini-badge is part of the SUMO series. It represents contribution to SUMO in 2014; in this case: 10 approved translation edits of the SUMO Knowledge Base. Congrats to all SUMO L10n 2014 badge earners for advancing the Mozilla Mission!
ha: Ƙaramin bajon SUMO L10n 2014 na daga ɓangaren jerin SUMO. Yana wakiltar gudun mawa ga SUMO a 2014; a wannan halin: 10 sun amince da gyaran fassara na Tushen Ilimi a SUMO. Taya murna ga duk waɗanda suka sami bajon SUMO L10n 2014 domin haɓaka Manufar Mozilla!

source: The template "%s" does not exist or has no approved revision.
ha: Babu allon misali "%s" ko kuma ba shi da amincewa ta nazari.

source: The title is too short (%(show_value)s characters). It must be at least %(limit_value)s characters.
ha: Take ya yi gajarta ƙwarai (%(show_value)s characters). Dole ya zama a ƙalla %(limit_value)s haruffa.

source: The URL has changed!
ha: URL ɗin ya canja!

source: The user name you entered is inappropriate. Please pick another and consider that our helpers are other Firefox users just like you.
ha: Suna na mai amfani da ka shigar ba dai dai ba ne. Zaɓi wani kuma ka lura cewa masu taimakawa su ma masu amfani da Firefox ne kamar kai.

source: The video "%s" does not exist.
ha: Bidiyon "%s" babu ita.

source: Thimble
ha: Shafi

source: This account is already banned!
ha: An riga an haramta wannan asusun!

source: This account is already being ignored!
ha: Tuni an yi watsi da wannan asusun!

source: This account is inactive.
ha: Wannan asusun ba ya aiki.

source: This article doesn't have approved content yet.
ha: Wannan maƙala ba ta da amincewar abin ciki tukuna.

source: This article is no longer maintained, so its content might be out of date.
ha: Ba'a tsare wannan maƙalar ba, sabo da haka abin cikinta na iya zama tsoho.

source: This badge is awarded to contributors with 10 approved English edits during 2015.
ha: An bayar da wannan bajon ga masu bayar da gudun mawa waɗan da ke da amincewar gyararraki na Turanci 10 lokacin 2015.

source: This badge is awarded to contributors with 10 approved translations edits during 2008.
ha: An bayar da wannan bajo ga masu bayar da gudun mawa waɗan da suke da gyaran fassara 10 da aka amince da su lokacin 2008.

source: This badge is awarded to contributors with 10 approved translations edits during 2009.
ha: An bayar da wannan bajo ga masu bayar da gudun mawa waɗan da suke da gyaran fassara 10 da aka amince da su lokacin 2009.

source: This badge is awarded to contributors with 10 approved translations edits during 2015.
ha: An bayar da wannan bajon ga masu bayar da gudun mawa waɗan da ke da amincewar gyararrakin fassara 10 lokacin 2015.

source: This badge is awarded to contributors with 30 support forum replies during 2015.
ha: Wannan bajo an bayar da shi ga masu bayar da gudun mawa waɗanda su ka bayar da tallafin amsoshi 30 na dandali a 2015.

source: This badge is awarded to contributors with 50 Army of Awesome tweets during 2015.
ha: An bayar da wannan bajon ga masu bayar da gudun mawa waɗan da ke da tweets 50 na Rungunar Burgewa lokacin 2015.

source: This document does not have a current revision.
ha: Wannan daftari ba shi da nazari na yanzu.

source: This document does not have a current translation.
ha: Wannan daftarin ba shi da fassara ta yanzu.

source: This document has already been translated to the following locales:
ha: An riga an fassara wannan daftarin zuwa waɗan nan wuraren:

source: This document has been translated to the following locales:
ha: An fassara wannan daftarin zuwa waɗan nan wuraren:

source: This document has no revisions.
ha: Wannan daftarin ba shi da nazarce-nazarce.

source: This document is missing translations for the following locales:
ha: Wannan daftarin ba shi da fassara daga waɗan nan wuraren:

source: This doesn't solve my problem
ha: Wannan bai warware matsalata ba

source: This edit does not make this article up to date. The English differences should not change on the next edit.
ha: Wannan gyaran bai mayar da wannan maƙala sabuwa ba. Bambance-bambancen Turanci ba zai canja a gyaran gaba ba.

source: This email is already in use!
ha: An riga an yi amfani da wannan imel ɗin!
